arcoslab/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
      // We got all the results
      trans->status = I2CTransSuccess;

      return STMI2C_SubTra_Ready_StopRequested;
    }

    // Check for end of transaction: start waiting for BTF instead of RXNE
    if (periph->idx_buf < (trans->len_r - 3))
    {
      //I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
    }
    else // idx >= len-3: there are 3 bytes to be read
    {
      // We want to halt I2C to have sufficient time to clear ACK, so:
      // Stop listening to RXNE as it will be triggered infinitely since we did not empty the buffer
      // on the next (second in buffer) received byte BTF will be set (buffer full and I2C halted)
      //I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
    }
  }
  // Buffer is full while this was not a RXNE interrupt
  else if (BIT_X_IS_SET_IN_REG(I2C_ISR_TC, ISR) )
  {
    // Now the shift register and data register contain data(n-2) and data(n-1)
    // And I2C is halted so we have time

    // --- Make absolutely sure the next 2 I2C actions are performed with no delay
    __I2C_REG_CRITICAL_ZONE_START;

    // First we clear the ACK while the SCL is held low by BTF
    I2C_CR2(i2c) &=  I2C_CR2_NACK;

    // Now that ACK is cleared we read one byte: instantly the last byte is being clocked in...
    trans->buf[periph->idx_buf] = I2C_RXDR(i2c);
    periph->idx_buf ++;

    // Now the last byte is being clocked. Stop in MUST be set BEFORE the transfer of the last byte is complete
    PPRZ_I2C_SEND_STOP(i2c);

    __I2C_REG_CRITICAL_ZONE_STOP;
    // --- end of critical zone -----------

    // Document the current Status
    periph->status = I2CStopRequested;

    // read the byte2 we had in the buffer (BTF means 2 bytes available)
    trans->buf[periph->idx_buf] = I2C_RXDR(i2c);
    periph->idx_buf ++;

    // Ask for an interrupt to read the last byte (which is normally still busy now)
    // The last byte will be received with RXNE
    //I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
  }
  else // Event Logic Error
  {
    return STMI2C_SubTra_Error;
  }

  return STMI2C_SubTra_Busy;

#else

  uint16_t SR1 = I2C_SR1(i2c);

  // Start Condition Was Just Generated
  if (BIT_X_IS_SET_IN_REG( I2C_SR1_SB, SR1 ) )
  {
    I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
    // The first data byte will be acked in read many so the slave knows it should send more
    I2C_CR1(i2c) &= ~ I2C_CR1_POS;
    I2C_CR1(i2c) |= I2C_CR1_ACK;
    // Clear the SB flag
    I2C_DR(i2c) = trans->slave_addr | 0x01;

    // Document the current Status
    periph->status = I2CAddrRdSent;
  }
  // Address Was Sent
  else if (BIT_X_IS_SET_IN_REG(I2C_SR1_ADDR, SR1) )
  {
    periph->idx_buf = 0;

    // Enable RXNE: receive an interrupt any time a byte is available
    // only enable if MORE than 3 bytes need to be read
    if (periph->idx_buf < (trans->len_r - 3))
    {
      I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
    }

    // ACK is still on to get more DATA
    // Read SR2 to clear the ADDR (next byte will start arriving)
    uint16_t SR2 __attribute__ ((unused)) = I2C_SR2(i2c);

    // Document the current Status
    periph->status = I2CReadingByte;
  }
  // one or more bytes are available AND we were interested in Buffer interrupts
  else if ( (BIT_X_IS_SET_IN_REG(I2C_SR1_RxNE, SR1) ) && (BIT_X_IS_SET_IN_REG(I2C_CR2_ITBUFEN, I2C_CR2(i2c)))  )
  {
    // read byte until 3 bytes remain to be read (e.g. len_r = 6, -> idx=3 means idx 3,4,5 = 3 remain to be read
    if (periph->idx_buf < (trans->len_r - 3))
    {
      trans->buf[periph->idx_buf] = I2C_DR(i2c);
      periph->idx_buf ++;
    }
    // from : 3bytes -> last byte: do nothing
    //
    // finally: this was the last byte
    else if (periph->idx_buf >= (trans->len_r - 1))
    {
      I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;

      // Last Value
      trans->buf[periph->idx_buf] = I2C_DR(i2c);
      periph->idx_buf ++;

      // We got all the results
      trans->status = I2CTransSuccess;

      return STMI2C_SubTra_Ready_StopRequested;
    }

    // Check for end of transaction: start waiting for BTF instead of RXNE
    if (periph->idx_buf < (trans->len_r - 3))
    {
      I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
    }
    else // idx >= len-3: there are 3 bytes to be read
    {
      // We want to halt I2C to have sufficient time to clear ACK, so:
      // Stop listening to RXNE as it will be triggered infinitely since we did not empty the buffer
      // on the next (second in buffer) received byte BTF will be set (buffer full and I2C halted)
      I2C_CR2(i2c) &= ~ I2C_CR2_ITBUFEN;
    }
  }
  // Buffer is full while this was not a RXNE interrupt
  else if (BIT_X_IS_SET_IN_REG(I2C_SR1_BTF, SR1) )
  {
    // Now the shift register and data register contain data(n-2) and data(n-1)
    // And I2C is halted so we have time

    // --- Make absolutely sure the next 2 I2C actions are performed with no delay
    __I2C_REG_CRITICAL_ZONE_START;

    // First we clear the ACK while the SCL is held low by BTF
    I2C_CR1(i2c) &= ~ I2C_CR1_ACK;

    // Now that ACK is cleared we read one byte: instantly the last byte is being clocked in...
    trans->buf[periph->idx_buf] = I2C_DR(i2c);
    periph->idx_buf ++;

    // Now the last byte is being clocked. Stop in MUST be set BEFORE the transfer of the last byte is complete
    PPRZ_I2C_SEND_STOP(i2c);

    __I2C_REG_CRITICAL_ZONE_STOP;
    // --- end of critical zone -----------

    // Document the current Status
    periph->status = I2CStopRequested;

    // read the byte2 we had in the buffer (BTF means 2 bytes available)
    trans->buf[periph->idx_buf] = I2C_DR(i2c);
    periph->idx_buf ++;

    // Ask for an interrupt to read the last byte (which is normally still busy now)
    // The last byte will be received with RXNE
    I2C_CR2(i2c) |= I2C_CR2_ITBUFEN;
  }
  else // Event Logic Error
  {
    return STMI2C_SubTra_Error;
  }

  return STMI2C_SubTra_Busy;

#endif

}

////////////////////////////////////////////////
// Restore bus conditions to normal after errors

static inline void i2c_error(struct i2c_periph *periph)
{
#ifdef I2C_DEBUG_LED
  uint8_t err_nr = 0;
#endif
#ifdef STM32F3
  periph->errors->er_irq_cnt;
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_NACKF) != 0) { /* Acknowledge failure */
    periph->errors->ack_fail_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= I2C_ISR_NACKF;
#else
  periph->errors->er_irq_cnt;
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_AF) != 0) { /* Acknowledge failure */
    periph->errors->ack_fail_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_AF;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 1;
#endif
  }
#ifdef STM32F3
if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_BERR) != 0) {     /* Misplaced Start or Stop condition */
    periph->errors->miss_start_stop_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_BERR;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_BERR) != 0) {     /* Misplaced Start or Stop condition */
    periph->errors->miss_start_stop_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_BERR;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 2;
#endif
  }
#ifdef STM32F3
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_ARLO) != 0) {     /* Arbitration lost */
    periph->errors->arb_lost_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_ARLO;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_ARLO) != 0) {     /* Arbitration lost */
    periph->errors->arb_lost_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_ARLO;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 3;
#endif
  }
#ifdef STM32F3
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_OVR) != 0) {      /* Overrun/Underrun */
    periph->errors->over_under_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_OVR;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_OVR) != 0) {      /* Overrun/Underrun */
    periph->errors->over_under_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_OVR;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 4;
#endif
  }
#ifdef STM32F3
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_PECERR) != 0) {   /* PEC Error in reception */
    periph->errors->pec_recep_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_PECERR;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_PECERR) != 0) {   /* PEC Error in reception */
    periph->errors->pec_recep_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_PECERR;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 5;
#endif
  }
#ifdef STM32F3
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_TIMEOUT) != 0) {  /* Timeout or Tlow error */
    periph->errors->timeout_tlow_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_TIMEOUT;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_TIMEOUT) != 0) {  /* Timeout or Tlow error */
    periph->errors->timeout_tlow_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_TIMEOUT;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 6;
#endif
  }
#ifdef STM32F3
  if ((I2C_ISR((uint32_t)periph->reg_addr) & I2C_ISR_ALERT) != 0) { /* SMBus alert */
    periph->errors->smbus_alert_cnt++;
    I2C_ISR((uint32_t)periph->reg_addr) &= ~I2C_ISR_ALERT;
#else
  if ((I2C_SR1((uint32_t)periph->reg_addr) & I2C_SR1_SMBALERT) != 0) { /* SMBus alert */
    periph->errors->smbus_alert_cnt++;
    I2C_SR1((uint32_t)periph->reg_addr) &= ~I2C_SR1_SMBALERT;
#endif
#ifdef I2C_DEBUG_LED
    err_nr = 7;
#endif
  }

