arcoslab/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
  /* Configure and enable I2C1 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C1_EV_IRQ, 0);
  nvic_enable_irq(NVIC_I2C1_EV_IRQ);

  /* Configure and enable I2C1 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C1_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C1_ER_IRQ);

  /* Enable peripheral clocks -------------------------------------------------*/
  /* Enable I2C1 clock */
  rcc_peripheral_enable_clock(&RCC_APB1ENR, RCC_APB1ENR_I2C1EN);
  /* Enable GPIO clock */
  gpio_enable_clock(I2C1_GPIO_PORT);
#if defined(STM32F1)
  gpio_set_mode(I2C1_GPIO_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_ALTFN_OPENDRAIN,
                I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#elif defined(STM32F3)
	rcc_peripheral_enable_clock(&RCC_AHBENR, RCC_AHBENR_IOPBEN);
  gpio_mode_setup(I2C1_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C1_GPIO_SCL | I2C1_GPIO_SDA);
	gpio_set_output_options(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C1_GPIO_SCL | I2C1_GPIO_SDA);
	gpio_set_af(I2C1_GPIO_PORT, GPIO_AF4, I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#elif defined(STM32F4)
  gpio_mode_setup(I2C1_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C1_GPIO_SCL | I2C1_GPIO_SDA);
  gpio_set_output_options(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C1_GPIO_SCL | I2C1_GPIO_SDA);
  gpio_set_af(I2C1_GPIO_PORT, GPIO_AF4, I2C1_GPIO_SCL | I2C1_GPIO_SDA);
#endif

  i2c_reset(I2C1);

  // enable peripheral
  i2c_peripheral_enable(I2C1);

  /*
   * XXX: there is a function to do that already in libopencm3 but I am not
   * sure if it is correct, using direct register instead (esden)
   */
  //i2c_set_own_7bit_slave_address(I2C1, 0);
  I2C_OAR1(I2C1) = 0 | 0x4000;

#ifdef STM32F3
  // enable error interrupts
  I2C_CR1(I2C1) |= I2C_CR1_ERRIE;
#else
  // enable error interrupts
  I2C_CR2(I2C1) |= I2C_CR2_ITERREN;
#endif

  i2c_setbitrate(&i2c1, I2C1_CLOCK_SPEED);
#endif
}

void i2c1_ev_isr(void) {
#ifdef STM32F3
  u32 i2c = (u32) i2c1.reg_addr;
  I2C_CR1(i2c) &= ~I2C_CR1_ERRIE;
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
  I2C_CR1(i2c) |= I2C_CR1_ERRIE;
#else
  uint32_t i2c = (uint32_t) i2c1.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITERREN;
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
#endif
}

void i2c1_er_isr(void) {
#ifdef STM32F3
  u32 i2c = (u32) i2c1.reg_addr;
  //I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
  //I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#else
  uint32_t i2c = (uint32_t) i2c1.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
  i2c_irq(&i2c1);
  i2c1_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#endif
}

#endif /* USE_I2C1 */

#ifdef USE_I2C2

/** default I2C2 clock speed */
#ifndef I2C2_CLOCK_SPEED
#define I2C2_CLOCK_SPEED 300000
#endif
PRINT_CONFIG_VAR(I2C2_CLOCK_SPEED)

struct i2c_errors i2c2_errors;
volatile uint32_t i2c2_watchdog_counter;

void i2c2_hw_init(void) {

  i2c2.reg_addr = (void *)I2C2;
  i2c2.init_struct = NULL;
  i2c2.errors = &i2c2_errors;
  i2c2_watchdog_counter = 0;

  /* zeros error counter */
  ZEROS_ERR_COUNTER(i2c2_errors);

  /* reset peripheral to default state ( sometimes not achieved on reset :(  ) */
  //i2c_reset(I2C2);

  /* Configure priority grouping 0 bits for pre-emption priority and 4 bits for sub-priority. */
  scb_set_priority_grouping(SCB_AIRCR_PRIGROUP_NOGROUP_SUB16);

#ifdef STM32F3
  /* Configure and enable I2C2 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C2_EV_EXTI24_IRQ, 0);
  nvic_enable_irq(NVIC_I2C2_EV_EXTI24_IRQ);

  /* Configure and enable I2C2 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C2_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C2_ER_IRQ);
#else
  /* Configure and enable I2C2 event interrupt --------------------------------*/
  nvic_set_priority(NVIC_I2C2_EV_IRQ, 0);
  nvic_enable_irq(NVIC_I2C2_EV_IRQ);

  /* Configure and enable I2C2 err interrupt ----------------------------------*/
  nvic_set_priority(NVIC_I2C2_ER_IRQ, 1);
  nvic_enable_irq(NVIC_I2C2_ER_IRQ);
#endif

  /* Enable peripheral clocks -------------------------------------------------*/
  /* Enable I2C2 clock */
  rcc_peripheral_enable_clock(&RCC_APB1ENR, RCC_APB1ENR_I2C2EN);
  /* Enable GPIO clock */
  gpio_enable_clock(I2C2_GPIO_PORT);
#if defined(STM32F1)
  gpio_set_mode(I2C2_GPIO_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_ALTFN_OPENDRAIN,
                I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#elif defined(STM32F3)
	rcc_peripheral_enable_clock(&RCC_AHBENR, RCC_AHBENR_IOPBEN);
  gpio_mode_setup(I2C2_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C2_GPIO_SCL | I2C2_GPIO_SDA);
	gpio_set_output_options(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C2_GPIO_SCL | I2C2_GPIO_SDA);
	gpio_set_af(I2C2_GPIO_PORT, GPIO_AF4, I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#elif defined(STM32F4)
  gpio_mode_setup(I2C2_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE,
                  I2C2_GPIO_SCL | I2C2_GPIO_SDA);
  gpio_set_output_options(I2C2_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ,
                          I2C2_GPIO_SCL | I2C2_GPIO_SDA);
  gpio_set_af(I2C2_GPIO_PORT, GPIO_AF4, I2C2_GPIO_SCL | I2C2_GPIO_SDA);
#endif

  i2c_reset(I2C2);

  // enable peripheral
  i2c_peripheral_enable(I2C2);

  /*
   * XXX: there is a function to do that already in libopencm3 but I am not
   * sure if it is correct, using direct register instead (esden)
   */
  //i2c_set_own_7bit_slave_address(I2C2, 0);
  I2C_OAR1(I2C2) = 0 | 0x4000;

#ifdef STM32F3
  // enable error interrupts
  I2C_CR1(I2C1) |= I2C_CR1_ERRIE;
#else
  // enable error interrupts
  I2C_CR2(I2C1) |= I2C_CR2_ITERREN;
#endif
  i2c_setbitrate(&i2c2, I2C2_CLOCK_SPEED);
}

void i2c2_ev_isr(void) {
#ifdef STM32F3
  u32 i2c = (u32) i2c2.reg_addr;
  I2C_CR1(i2c) &= ~I2C_CR1_ERRIE;
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
  I2C_CR1(i2c) |= I2C_CR1_ERRIE;
#else
  uint32_t i2c = (uint32_t) i2c2.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITERREN;
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITERREN;
#endif
}

void i2c2_er_isr(void) {
#ifdef STM32F3
  u32 i2c = (u32) i2c2.reg_addr;
  //I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
  //I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#else
  uint32_t i2c = (uint32_t) i2c2.reg_addr;
  I2C_CR2(i2c) &= ~I2C_CR2_ITEVTEN;
  i2c_irq(&i2c2);
  i2c2_watchdog_counter = 0;
  I2C_CR2(i2c) |= I2C_CR2_ITEVTEN;
#endif
}

