arcoslab/paparazzi/sw/airborne/arch/stm32/mcu_periph/i2c_arch.c
/////////////////////////////////////////////////////////
// Implement Interface Functions

bool_t i2c_submit(struct i2c_periph* periph, struct i2c_transaction* t) {

  uint8_t temp;
  temp = periph->trans_insert_idx + 1;
  if (temp >= I2C_TRANSACTION_QUEUE_LEN) temp = 0;
  if (temp == periph->trans_extract_idx)
    return FALSE;                          // queue full

  t->status = I2CTransPending;

  __disable_irq();
  /* put transacation in queue */
  periph->trans[periph->trans_insert_idx] = t;
  periph->trans_insert_idx = temp;

  /* if peripheral is idle, start the transaction */
  // if (PPRZ_I2C_IS_IDLE(p))
  if (periph->status == I2CIdle)
  {
    //if (i2c_idle(periph))
    {
#ifdef I2C_DEBUG_LED
#ifdef USE_I2C1
      if (periph == &i2c1)
      {

      }
      else
#endif
#endif
      {
#ifdef I2C_DEBUG_LED
        LED2_ON();
        LED2_OFF();
#endif
        PPRZ_I2C_SEND_START(periph);
      }
    }
  }
  /* else it will be started by the interrupt handler when the previous transactions completes */
  __enable_irq();

  return TRUE;
}

bool_t i2c_idle(struct i2c_periph* periph)
{
  // This is actually a difficult function:
  // -simply reading the status flags can clear bits and corrupt the transaction

  uint32_t i2c = (uint32_t) periph->reg_addr;

#ifdef I2C_DEBUG_LED
#ifdef USE_I2C1
  if (periph == &i2c1)
  {
    return TRUE;
  }
#endif
#endif
#ifdef STM32F3
  // First we check if the software thinks it is ready
  if (periph->status == I2CIdle)
    return ! (BIT_X_IS_SET_IN_REG( I2C_ISR_BUSY, I2C_ISR(i2c) ) );
  else
    return FALSE;
#else
  // First we check if the software thinks it is ready
  if (periph->status == I2CIdle)
    return ! (BIT_X_IS_SET_IN_REG( I2C_SR2_BUSY, I2C_SR2(i2c) ) );
  else
    return FALSE;
#endif
}
